% Синтез цифрового НЧ СІХ-фільтра частотними вибірками
clear;
fc = 500;                   % Частота зрізу ФНЧ в Гц
K = [0 0 1 0 0 1 1 1 1 0 0 1 0 0 1 1]; % Зразкова АЧХ ФНЧ
n = max(size(K));           % Кількість відліків зразкової АЧХ
N = 256;                     % Порядок СІХ фільтра
df=fc/5; f=(0:df:df*(n-1)); % Частотний аргумент зразкової АЧХ в Гц
fnorm=f/f(n);               % Нормування частоти для ф-ції fir2
b = fir2(N*2,fnorm,K);      % Імпульсна хар-ка СІХ фільтра
coef = b(N+1:N*2)           % Коефіцієнти фільтра
dt=1/(fc/4*(N-1)); t=(0:dt:(N-1)*dt); % Вектор часового аргументу ІХ
plot(t,coef,'.-');          % Графічне зображення коефіцієнтів фільтра
xlabel('Час в секундах'); ylabel('Відліки імпульсної хар-ки');
title('Графічне зображення коефіцієнтів фільтра');
[W,w] = freqz(b,1,N);       % Обчислення комплексної АФЧХ W(jw)
fd=w/pi*f(n);               % Денормування частоти для графіка
figure; 
plot(f,K,'.-',fd,abs(W),'.-'); % Графічне порівняння АЧХ 
xlabel('Частота в Гц'); ylabel('АЧХ');
legend(' АЧХ зразкова','АЧХ спроектована'); title('Порівняння АЧХ');
